{
  "articles": [
    {
      "id": 1,
      "title": "Arsenal's Recent Form",
      "category": "Sports",
      "description": "Arsenal's recent form has been a cause for concern for the club's supporters and manager alike. The London-based club is currently languishing in mid-table, with only a few glimpses of the attractive, attacking football that has been synonymous with the club in recent history. The Gunners have struggled to put together a consistent run of form in the Premier League this season, with frustrating losses to teams lower down in the table. Manager Mikel Arteta has been vocal in his frustration with the team's performances, emphasizing the need for the players to take responsibility for their form and for the club to develop a winning mentality. While Arsenal have shown promise in other competitions, such as the Europa League, it is clear that the Premier League remains the primary focus for the club. The team's fortunes will depend on the ability of key players such as Pierre-Emerick Aubameyang and Bukayo Saka to rediscover their form and lead the team forward.",
      "likes": 17,
      "dislikes": 11,
      "image": "https://i2-prod.dailystar.co.uk/incoming/article28194105.ece/ALTERNATES/s615/0_JS280028828.jpg"
    },
    {
      "id": 2,
      "title": "The State of Kenyan Politics",
      "category": "Politics",
      "description": "Kenya's political landscape has been characterized by tension and uncertainty in recent years, with issues such as corruption, ethnic tensions, and the COVID-19 pandemic all playing a role. The upcoming general elections in 2022 will be a crucial moment for the country, with many hoping for a peaceful and fair process that can set Kenya on a path towards stability and progress.",
      "likes": 17,
      "dislikes": 3,
      "image": "https://example.com/image2.jpg"
    },
    {
      "id": 3,
      "title": "2022 Fashion Trends",
      "category": "Fashion",
      "description": "As we move into 2022, fashion trends are continuing to evolve and adapt to changing social and cultural contexts. Sustainable and ethical fashion remains a growing movement, with more and more brands prioritizing responsible sourcing and production. Other trends for the year include bold, colorful prints and statement pieces, as well as a continued focus on comfort and versatility in clothing.",
      "likes": 17,
      "dislikes": 10,
      "image": "https://example.com/image3.jpg"
    }
  ]
}